import {I18nManager} from 'react-native';
import {colors, HP, images} from '../../../../../../services';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
تذكر أنك تتمتع بالحق في معرفة حالتك الصحية والعلاج المناسب لك ، سوف يتم منحك الوقت الكافي ( وفقاً لحالتك الطبية ) للوصول الى قرار الموافقة الصحيحة
</li>
<li>
سيطلب منك التوقيع على نموذج الموافقة العامة عند الدخول الى المستشفى للسماح لفريق الرعاة الصحية بعمل الإجراءات التشخصية اللازمة مثل : الفحوصات الروتينية للدم
</li>

</ul>

</container>
`
      : `
      <container>
      <ul>
      <li>
      تذكر أنك تتمتع بالحق في معرفة حالتك الصحية والعلاج المناسب لك ، سوف يتم منحك الوقت الكافي ( وفقاً لحالتك الطبية ) للوصول الى قرار الموافقة الصحيحة
      </li>
      <li>
      سيطلب منك التوقيع على نموذج الموافقة العامة عند الدخول الى المستشفى للسماح لفريق الرعاة الصحية بعمل الإجراءات التشخصية اللازمة مثل : الفحوصات الروتينية للدم
      </li>
      
      </ul>
      
      </container>
      `,
  },
];
