import {I18nManager} from 'react-native';
import {colors, fontFamilies, HP, images, WP} from '../../../../../../services';
import {smallScreens} from '../../../../../../services/utilities/responsive';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<center>
<p style="margin-bottom:5">
وضع مستشفى الأطباء المتحدون السياسات التالية حفاظاً على سلامتك
</p>
</center>
<h4>
الاجهزة الكهربائية:
</h4>
<p>
لا يسمح بالراديو ومصفف الشعر والتلفزيون المحمول والأجهزة
الشخصية الأخرى لانها قد تمثل خطورة نظرا لأنها تتطلب التعامل
 .مع الكهرباء 
</p>
<h4>
الحريق:
</h4>
<p>
في حالة سماع جرس الإنذار حافظ على هدوئك ومكانك ولا تتحرك
تجري مستشفى الأطباء المتحدون أحيانا تدريبات على مكافحة الحريق
للارتقاء بمستوى افراد طاقم العمل في السلامة من الحرائق ولاختبار
.نظام الإنذار
</p>
<p style="margin-top: 10">
في حالة نشوب حريق ، يرشدك أفراد طاقم العمل الى إجراءات السلامة
</p>
<h4>
التدخين:
</h4>
<p>
تدرك مستشفى الأطباء المتحدون مخاطر التدخين وتفرض سياسة لمنع
التدخين في جميع اقسام المستشفى . لا يسمح للمرضى والزوار و
الأطباء والموظفين بالتدخين داخل الغرف مهما كانت الظروف ، غير
 .أنه يوجد مكان مخصص للتدخين خارج مبني الإدارة
</p>
<div
      style="
      margin-top:  ${HP('3')};
      margin-bottom:  ${HP('1.5')};
      width: 150;
      height: 150;
      align-self: center
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      object-fit: fill;
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/no-smoking-sign.jpg?alt=media&token=5266a1b7-93d9-4521-8e81-28b81c8f7b1b" />
      </div>
</container>
`
      : `
      <container>
      <center>
      <p style="margin-bottom:5">
      وضع مستشفى الأطباء المتحدون السياسات التالية حفاظاً على سلامتك
      </p>
      </center>
      <h4>
      الاجهزة الكهربائية:
      </h4>
      <p>
      لا يسمح بالراديو ومصفف الشعر والتلفزيون المحمول والأجهزة
      الشخصية الأخرى لانها قد تمثل خطورة نظرا لأنها تتطلب التعامل
       .مع الكهرباء 
      </p>
      <h4>
      الحريق:
      </h4>
      <p>
      في حالة سماع جرس الإنذار حافظ على هدوئك ومكانك ولا تتحرك
      تجري مستشفى الأطباء المتحدون أحيانا تدريبات على مكافحة الحريق
      للارتقاء بمستوى افراد طاقم العمل في السلامة من الحرائق ولاختبار
      .نظام الإنذار
      </p>
      <p style="margin-top: 10">
      في حالة نشوب حريق ، يرشدك أفراد طاقم العمل الى إجراءات السلامة
      </p>
      <h4>
      التدخين:
      </h4>
      <p>
      تدرك مستشفى الأطباء المتحدون مخاطر التدخين وتفرض سياسة لمنع
      التدخين في جميع اقسام المستشفى . لا يسمح للمرضى والزوار و
      الأطباء والموظفين بالتدخين داخل الغرف مهما كانت الظروف ، غير
       .أنه يوجد مكان مخصص للتدخين خارج مبني الإدارة
      </p>
      <div
            style="
            margin-top:  ${HP('3')};
            margin-bottom:  ${HP('1.5')};
            width: 150;
            height: 150;
            align-self: center
            "
            >
            <img 
            style="
            width: 100%;
            height: 100%;
            object-fit: fill;
            "
            src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/no-smoking-sign.jpg?alt=media&token=5266a1b7-93d9-4521-8e81-28b81c8f7b1b" />
            </div>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
      <container>
      <h4>
      الاتصالات الهاتفية:
      </h4>
      <ul>
      <li>
      لاجراء اتصال محلي ، اطلب (صفر) ثم اطلب الرقم المحلي
      </li>
      <li>
      لطلب موظف السنترال اطلب (9) 
      </li>
      <li>
      للاتصال المباشر بالغرف أو احد ارقام داخل المستشفى ، اطلب
      الرقم مباشرة 
      </li>
      <li>
      لإجراء اتصال دولي اطلب الرقم (9) وسوف يساعدك مأمور 
      السنترال 
      </li>
      </ul>
      <div style="
        align-self: center;
        width:${WP('80')};
        align-items: center;
        ">
      <div 
      style="background-color: ${colors.danger};
       width:${WP('70')};
        align-items: center;
        padding-top: 10;
        padding-bottom: 10;
        border-radius: 20;
        margin-top: 20;">

        <p style="
        color: ${colors.whiteAbsolute};
         font-family: ${fontFamilies('boldText')};
         font-size: 10
         
         ">
         تنبيه هام ( استقبال المكالمات من خارج المستشفى )
         </p> 
        </div>
        <div class="bordered-box">
        <p style="padding-top: 20">إن نظام السنترال الالي المتوافر بالمستشفى يسمح لاقارب المريض بالاتصال المباشر على غرفته من خلال ادخال رقم الغرفة بعد سماع الرد الالي.<br/> ولكن للأسف قد يعبث بعض ذوي الاخلاق الهابطة بهذه الخدمة من خلال الاتصال المباشر على غرف المرضى لغرض المعاكسات وذلك بانتحال صفة احد أطباء او موظفي المستشفى او الأخصائيين الاجتماعيين او موظفي بنك او ما شابه ذلك ، اذا حدث ذلك فنرجو منك أختي المريضة ان تقومي بإغلاق الخط فوراً وتجاهل المكالمة او الاتصال بمأمور السنترال لطلب تحويل الخط من خلال سنترال المستشفى علما بان نطام المستشفى يمنع موظفي المستشفى من الاستفسار عن حالة المريض هاتفيا وللمزيد من الأمان سيتحقق مأمور السنترال من جدية المتصل بسؤاله عن اسم المريض المنوم بالغرفة المطلوبة اذا تم تحويل المكالمة عبر السنترال عند طلبكم لذلك</p>
        </div>
      </div>
        
      </container>
      `
      : `
      <container>
      <h4>
      الاتصالات الهاتفية:
      </h4>
      <ul>
      <li>
      لاجراء اتصال محلي ، اطلب (صفر) ثم اطلب الرقم المحلي
      </li>
      <li>
      لطلب موظف السنترال اطلب (9) 
      </li>
      <li>
      للاتصال المباشر بالغرف أو احد ارقام داخل المستشفى ، اطلب
      الرقم مباشرة 
      </li>
      <li>
      لإجراء اتصال دولي اطلب الرقم (9) وسوف يساعدك مأمور 
      السنترال 
      </li>
      </ul>
      
      <div style="
      align-self: center;
      width:${WP('80')};
      align-items: center;
      ">
    <div 
    style="background-color: ${colors.danger};
     width:${WP('70')};
      align-items: center;
      padding-top: 10;
      padding-bottom: 10;
      border-radius: 20;
      margin-top: 20;">

      <p style="
      color: ${colors.whiteAbsolute};
       font-family: ${fontFamilies('boldText')};
       font-size: 10
       
       ">
       تنبيه هام ( استقبال المكالمات من خارج المستشفى )
       </p> 
      </div>
      <div class="bordered-box">
      <p style="padding-top: 20">إن نظام السنترال الالي المتوافر بالمستشفى يسمح لاقارب المريض بالاتصال المباشر على غرفته من خلال ادخال رقم الغرفة بعد سماع الرد الالي.<br/> ولكن للأسف قد يعبث بعض ذوي الاخلاق الهابطة بهذه الخدمة من خلال الاتصال المباشر على غرف المرضى لغرض المعاكسات وذلك بانتحال صفة احد أطباء او موظفي المستشفى او الأخصائيين الاجتماعيين او موظفي بنك او ما شابه ذلك ، اذا حدث ذلك فنرجو منك أختي المريضة ان تقومي بإغلاق الخط فوراً وتجاهل المكالمة او الاتصال بمأمور السنترال لطلب تحويل الخط من خلال سنترال المستشفى علما بان نطام المستشفى يمنع موظفي المستشفى من الاستفسار عن حالة المريض هاتفيا وللمزيد من الأمان سيتحقق مأمور السنترال من جدية المتصل بسؤاله عن اسم المريض المنوم بالغرفة المطلوبة اذا تم تحويل المكالمة عبر السنترال عند طلبكم لذلك</p>
      </div>
    </div>
      </container>
      `,
  },
];
