import {I18nManager} from 'react-native';
import {colors, HP, images} from '../../../../../../services';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>الأطباء</h4>
<ul style="margin-top: 10">
<li>
يرأس طبيبك المعالج فريق الرعاية الصحية المعني بك ويساعده
في دلك أخصائي أو طبيب مقيم
</li>
</ul>
<h4 style="margin-top: 20">الممرضات</h4>
<ul>
<li>
تقوم الممرضة بترتيب إجراءات الرعاية الخاصة بك 
</li>
<li>
ستقضي مع فريق التمريض وقتا أطول من أي وقت تقضيه مع أي عضو من أعضاء فريق الرعاية الصحية الخاصة بك ، فهن اللاتي سيوفرن لك الرعاية الجسدية والتثقيف الصحي والدعم النفسي
</li>
<li>
في كل مناوبة سوف تقوم ممرضة خاصة بالأشراف على رعايتك
</li>
</ul>
<h4 style="margin-top: 20">الصيادلة</h4>
<ul>
<li>
يتعاون فريق الصيدلة مع طبيبك الخاص لتوفير الاوية اللازمة لعلاجك ، وعند شفائك واتخاد القرار بخروجك من المستشفى سيتم شرح كيفية استخدام الادوية من قبل الطبيب المقيم أو الممرضة
</li>
</ul>
<h4 style="margin-top: 20">الاخصائيون الاجتماعيون</h4>
<ul>
<li>
يساعدك الاخصائيون الاجتماعيون في فهم المرض والمضاعفات الطبية المحتملة وكيفية التغلب عليها ويسعون أيضا لتوفير الخدمات الاجتماعية التي تعينك على الشفاء يمكن لك ولطبيبك ولأفراد اسرتك طلب زيارة الاخصائيين الاجتماعيين ودلك بالاتصال على رقم (2805) ويمكن توصيلك بالأخصائي الاجتماعي من خلال مأمور السنترال
</li>
</ul>
</container>
`
      : `
      <container>
      <h4>الأطباء</h4>
      <ul style="margin-top: 10">
      <li>
      يرأس طبيبك المعالج فريق الرعاية الصحية المعني بك ويساعده
      في دلك أخصائي أو طبيب مقيم
      </li>
      </ul>
      <h4 style="margin-top: 20">الممرضات</h4>
      <ul>
      <li>
      تقوم الممرضة بترتيب إجراءات الرعاية الخاصة بك 
      </li>
      <li>
      ستقضي مع فريق التمريض وقتا أطول من أي وقت تقضيه مع أي عضو من أعضاء فريق الرعاية الصحية الخاصة بك ، فهن اللاتي سيوفرن لك الرعاية الجسدية والتثقيف الصحي والدعم النفسي
      </li>
      <li>
      في كل مناوبة سوف تقوم ممرضة خاصة بالأشراف على رعايتك
      </li>
      </ul>
      <h4 style="margin-top: 20">الصيادلة</h4>
      <ul>
      <li>
      يتعاون فريق الصيدلة مع طبيبك الخاص لتوفير الاوية اللازمة لعلاجك ، وعند شفائك واتخاد القرار بخروجك من المستشفى سيتم شرح كيفية استخدام الادوية من قبل الطبيب المقيم أو الممرضة
      </li>
      </ul>
      <h4 style="margin-top: 20">الاخصائيون الاجتماعيون</h4>
      <ul>
      <li>
      يساعدك الاخصائيون الاجتماعيون في فهم المرض والمضاعفات الطبية المحتملة وكيفية التغلب عليها ويسعون أيضا لتوفير الخدمات الاجتماعية التي تعينك على الشفاء يمكن لك ولطبيبك ولأفراد اسرتك طلب زيارة الاخصائيين الاجتماعيين ودلك بالاتصال على رقم (2805) ويمكن توصيلك بالأخصائي الاجتماعي من خلال مأمور السنترال
      </li>
      </ul>
      </container>
      `,
  },
];
