import {I18nManager} from 'react-native';
import {colors, HP, images, WP} from '../../../../../../services';
import {smallScreens} from '../../../../../../services/utilities/responsive';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
التزم بتعليمات السلامة المنتشرة في ارجاء المستشفى
</li>
<li>
تعرف على مخارج الطوارئ بالمستشفى
</li>
<li>
‏لا تستخدم تمديدات كهربائية من تلقاء نفسك داخل غرفتك
</li>
</ul>
<center>
<div
style="
margin-top:  ${HP('1.5')};
margin-bottom:  ${HP('1.5')};
height: ${HP('30')}
"
>
<img 
style="
width: 100%;
height: 100%;
"
src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/Untitled-4.jpg?alt=media&token=ce76a0ef-d85a-4f41-bcae-f6ac10b338c4" />
</div>
<center>
<p>تعرف على مخارج الطوارئ</p>
</center>
<ul style="margin-top: 20px">
<li style="margin-bottom: 5;>
‏لا تستخدم أي مواقد للنار من تلقاء نفسك في غرفتك
</li>
<li style="margin-bottom: 5">
‏التزم بعدم التدخين تماماً داخل مبني المستشفى
</li>
<li style="margin-bottom: 5">
التزم بالوجبات الغذائية التي قررها لك أطباء المستشفى ولا تتناول
أي اطعمة من خارج المستشفى
</li>
<li style="margin-bottom: 5">
اغسل يديك بالماء والصابون قبل وبعد كل وجبة
</li>
<li style="margin-bottom: 5">
اغسل يديك بالماء والصابون بعد الخروج من دورة المياه
</li>
<li style="margin-bottom: 5">
بعد الانتهاء من الوجبة اطلب من طاقة الخدمة رفع الوجبه
</li>
</ul>
</container>
`
      : `
      <container>
      <ul>
      <li>
      التزم بتعليمات السلامة المنتشرة في ارجاء المستشفى
      </li>
      <li>
      تعرف على مخارج الطوارئ بالمستشفى
      </li>
      <li>
      ‏لا تستخدم تمديدات كهربائية من تلقاء نفسك داخل غرفتك
      </li>
      </ul>
      <center>
      <div
      style="
      margin-top:  ${HP('1.5')};
      margin-bottom:  ${HP('1.5')};
      height: ${HP('30')}
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/Untitled-4.jpg?alt=media&token=ce76a0ef-d85a-4f41-bcae-f6ac10b338c4" />
      </div>
      <center>
      <p>تعرف على مخارج الطوارئ</p>
      </center>
      <ul style="margin-top: 20px">
      <li style="margin-bottom: 5;>
      ‏لا تستخدم أي مواقد للنار من تلقاء نفسك في غرفتك
      </li>
      <li style="margin-bottom: 5">
      ‏التزم بعدم التدخين تماماً داخل مبني المستشفى
      </li>
      <li style="margin-bottom: 5">
      التزم بالوجبات الغذائية التي قررها لك أطباء المستشفى ولا تتناول
      أي اطعمة من خارج المستشفى
      </li>
      <li style="margin-bottom: 5">
      اغسل يديك بالماء والصابون قبل وبعد كل وجبة
      </li>
      <li style="margin-bottom: 5">
      اغسل يديك بالماء والصابون بعد الخروج من دورة المياه
      </li>
      <li style="margin-bottom: 5">
      بعد الانتهاء من الوجبة اطلب من طاقة الخدمة رفع الوجبه
      </li>
      </ul>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
‏في حال العطاس او السعال استخدم مناديل ورقية
</li>
<li>
‏بعض الغرف قد يكون على أبوابها لوحات او كروت ملونة حمراء
أو زرقاء أو خضراء اسال الممرضة أولا عن مدى مأمونية دخول تلك
الغرف
</li>
<li>
‏لا تلق أي سوائل او مخلفات في أرضية غرفتك
</li>
<li>
‏لو وجدت أي سوائل مسكوبة في أرضية غرفتك فاتصل بطواقم
الخدمة فوراً
</li>
<li>
‏تجنب لمس حاويات المخلفات البيولوجية دات العلامة الصفراء
</li>
</ul>
<center>
<div
      style="
      margin-top:  ${HP('1.5')};
      margin-bottom:  ${HP('1.5')};
      height: ${HP('30')};
      width: 150;
      align-self: center;
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/clinical-waste.jpg?alt=media&token=d2feceb8-f8fb-4d1e-87aa-6d7929d29920" />
      </div>
<ul style="margin-top: 20px">
<li style="margin-bottom: 5">
‏تجنب لمس الحاويات المخصصة لإلقاء الابر والمحاقن
</li>
<li style="margin-bottom: 5">
‏معقمات اليدين خصصت للطواقم الطبية وليست للمرضى أو
الزائرين
</li>
</ul>
</container>
`
      : `
      <container>
      <ul>
      <li>
      ‏في حال العطاس او السعال استخدم مناديل ورقية
      </li>
      <li>
      ‏بعض الغرف قد يكون على أبوابها لوحات او كروت ملونة حمراء
      أو زرقاء أو خضراء اسال الممرضة أولا عن مدى مأمونية دخول تلك
      الغرف
      </li>
      <li>
      ‏لا تلق أي سوائل او مخلفات في أرضية غرفتك
      </li>
      <li>
      ‏لو وجدت أي سوائل مسكوبة في أرضية غرفتك فاتصل بطواقم
      الخدمة فوراً
      </li>
      <li>
      ‏تجنب لمس حاويات المخلفات البيولوجية دات العلامة الصفراء
      </li>
      </ul>
      <center>
      <div
            style="
            margin-top:  ${HP('1.5')};
            margin-bottom:  ${HP('1.5')};
            height: ${HP('30')};
            width: 150;
            align-self: center;
            "
            >
            <img 
            style="
            width: 100%;
            height: 100%;
            "
            src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/clinical-waste.jpg?alt=media&token=d2feceb8-f8fb-4d1e-87aa-6d7929d29920" />
            </div>
      <ul style="margin-top: 20px">
      <li style="margin-bottom: 5">
      ‏تجنب لمس الحاويات المخصصة لإلقاء الابر والمحاقن
      </li>
      <li style="margin-bottom: 5">
      ‏معقمات اليدين خصصت للطواقم الطبية وليست للمرضى أو
      الزائرين
      </li>
      </ul>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
لا تترد في طرح أي أسئلة على المختصين أثناء فترة عملك
</li>
<li>
اذا وقفت اللغة حاجزاً فيمكنك طلب المساعدة لتفهم التعليمات
الطبية
</li>
<li>
‏اخبر طاقم المستشفى اذا ان لديك حساسية لبعض الادوية أو
التخدير
</li>
<li>
احتفظ دائماً بنسخة من ملفك الطبي
</li>
<li>
اسال عن نتائج التحاليل والاشعات التي أجريت لك
</li>
<li>
تاكد من وجود الطبيب المعني برعايتك
</li>
<li>
لا تخجل من سؤال طواقم المستشفى التي تتناوب على خدمتك
عن غسل أيديهم وارتدائهم للقفازات
</li>
<li>
اخبر الأطباء عن كل الادوية التي كنت تتناولها قبل دخولك الى
المستشفى
</li>
<li>
عند استلام الدواء يجب ان تتاكد ان الدواء الذي بحوزتك هو بالفعل
الدواء الدي وصفه لك الطبيب
</li>
<li>
عند استلام الدواء تأكد انك تستطيع قراءة الوصفة التي كتبها
الطبيب
</li>
<li>
عند استلام الدواء قم بقراءة نشرته الطبية بعناية واسال عن الآثار
الجانبية لهذا الدواء
</li>
<li>
اسال عن تفاصيل الدواء الموصوف لك : متي سيبدأ؟ وكم
 سيستغرق؟ عراضه الجانبية ؟ تفاعلاته مع أدويتك الأخرى ؟
</li>
<li>
اسال عن الأطعمة الممنوعة أثناء تعاطي هذا الدواء ؟
</li>
<li>
‏اذا تقرر اجراء جراحة فأسال الجراح عن تفاصيل الإجراءات
الجراحية التي سيتخذها
</li>
</ul>
</container>
`
      : `
      <container>
      <ul>
      <li>
      لا تترد في طرح أي أسئلة على المختصين أثناء فترة عملك
      </li>
      <li>
      اذا وقفت اللغة حاجزاً فيمكنك طلب المساعدة لتفهم التعليمات
      الطبية
      </li>
      <li>
      ‏اخبر طاقم المستشفى اذا ان لديك حساسية لبعض الادوية أو
      التخدير
      </li>
      <li>
      احتفظ دائماً بنسخة من ملفك الطبي
      </li>
      <li>
      اسال عن نتائج التحاليل والاشعات التي أجريت لك
      </li>
      <li>
      تاكد من وجود الطبيب المعني برعايتك
      </li>
      <li>
      لا تخجل من سؤال طواقم المستشفى التي تتناوب على خدمتك
      عن غسل أيديهم وارتدائهم للقفازات
      </li>
      <li>
      اخبر الأطباء عن كل الادوية التي كنت تتناولها قبل دخولك الى
      المستشفى
      </li>
      <li>
      عند استلام الدواء يجب ان تتاكد ان الدواء الذي بحوزتك هو بالفعل
      الدواء الدي وصفه لك الطبيب
      </li>
      <li>
      عند استلام الدواء تأكد انك تستطيع قراءة الوصفة التي كتبها
      الطبيب
      </li>
      <li>
      عند استلام الدواء قم بقراءة نشرته الطبية بعناية واسال عن الآثار
      الجانبية لهذا الدواء
      </li>
      <li>
      اسال عن تفاصيل الدواء الموصوف لك : متي سيبدأ؟ وكم
       سيستغرق؟ عراضه الجانبية ؟ تفاعلاته مع أدويتك الأخرى ؟
      </li>
      <li>
      اسال عن الأطعمة الممنوعة أثناء تعاطي هذا الدواء ؟
      </li>
      <li>
      ‏اذا تقرر اجراء جراحة فأسال الجراح عن تفاصيل الإجراءات
      الجراحية التي سيتخذها
      </li>
      </ul>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
‏لمزيد من ضمانات السلامة اطلب من الطبيب ان يحدد بالقلم
موضع العملية من جسدك
</li>
<li>
‏في يوم العملية لا تلمس بيدك الجزء الذي ستجرى فيه الجراحة
</li>
<li>
‏بعد انتهاء العملية لا تطلب من المستشفى الاحتفاظ باي قطعة
من انسجة جسدك ، ستخضع هذه الانسجة للتحليل الباثولوجي وهي
مسؤولية المستشفى فقط
</li>
<li>
‏اطلب من احد افراد عائلتك أو اصدقائك أن يكون بجانبك  عند
الحاجة
</li>
<li>
‏قبل المغادرة تفهم جيدا تعليمات الرعاية الصحية اللاحقة التي
ستسدى اليك
</li>
<li>
‏اسال طبيبك عن خطة العلاج بالمنزل واسال عن ادويتك وعن موعد
عودتك لأنشطتك المعتادة مثل : الاستحمام والنشاط الحركي والنظافة
الشخصية وقيادة السارة
</li>
<li>
‏قبل المغادرة اسال الطبيب أيضا عن الأطعمة التي يمكنك تناولها
والأخرى التي يجب الامتناع عنها
</li>
<li>
‏قبل المغادرة تأكد من توافر الدواء الموصوف لك بصيدلية المستشفى
 او الصيدليات الخارجية ولو تعذر توفير الدواء فاخبر طبيبك كي يصف
الدواء البديل
</li>
<li>
‏سجل هواتف وأسماء الأطباء الذين ستحتاج للمتابعة اللاحقة معهم
بعد عودتك للمنزل
</li>
<li>
‏قبل المغادرة تحقق من وجود الشخص الذي سيقوم بتوصيلك الي
المنزل احتفظ بهاتف ذلك الشخص للاتصال به عند الحاجة
</li>
</ul>
</container>
`
      : `
      <container>
      <ul>
      <li>
      ‏لمزيد من ضمانات السلامة اطلب من الطبيب ان يحدد بالقلم
      موضع العملية من جسدك
      </li>
      <li>
      ‏في يوم العملية لا تلمس بيدك الجزء الذي ستجرى فيه الجراحة
      </li>
      <li>
      ‏بعد انتهاء العملية لا تطلب من المستشفى الاحتفاظ باي قطعة
      من انسجة جسدك ، ستخضع هذه الانسجة للتحليل الباثولوجي وهي
      مسؤولية المستشفى فقط
      </li>
      <li>
      ‏اطلب من احد افراد عائلتك أو اصدقائك أن يكون بجانبك  عند
      الحاجة
      </li>
      <li>
      ‏قبل المغادرة تفهم جيدا تعليمات الرعاية الصحية اللاحقة التي
      ستسدى اليك
      </li>
      <li>
      ‏اسال طبيبك عن خطة العلاج بالمنزل واسال عن ادويتك وعن موعد
      عودتك لأنشطتك المعتادة مثل : الاستحمام والنشاط الحركي والنظافة
      الشخصية وقيادة السارة
      </li>
      <li>
      ‏قبل المغادرة اسال الطبيب أيضا عن الأطعمة التي يمكنك تناولها
      والأخرى التي يجب الامتناع عنها
      </li>
      <li>
      ‏قبل المغادرة تأكد من توافر الدواء الموصوف لك بصيدلية المستشفى
       او الصيدليات الخارجية ولو تعذر توفير الدواء فاخبر طبيبك كي يصف
      الدواء البديل
      </li>
      <li>
      ‏سجل هواتف وأسماء الأطباء الذين ستحتاج للمتابعة اللاحقة معهم
      بعد عودتك للمنزل
      </li>
      <li>
      ‏قبل المغادرة تحقق من وجود الشخص الذي سيقوم بتوصيلك الي
      المنزل احتفظ بهاتف ذلك الشخص للاتصال به عند الحاجة
      </li>
      </ul>
      </container>
      `,
  },
];
