import {I18nManager} from 'react-native';
import {colors, HP, images} from '../../../../../../services';

export default [
  {
    html: I18nManager.isRTL
      ? `
  <container>
  <center>
  <h3>واجبات المرضى</h3>
  </center>

  <h3>تشمل واجبات المرضى ما يلي:</h3>
  <h4 style="color: ${colors.red}">توفير المعلومات:</h4>
  <ul>
    <li>
    يجب على المريض أن يذكر لطبيبه التاريخ الصحي الكامل لحالته .والشكوى المرضية الحالية التي قدم من أجلها إلى المستشفى
    </li>
    <li>
    يجب على المريض إطلاع الطبيب المسؤول على التغيرات الطبية .المفاجئة لحالته  
    </li>
    <li>
    يجب على المريض إيضاح ما إذا كان يتفهم الحالة المرضية التي .تم شرحها له من مقدم الخدمة الطبية والعلاج الموصوف له
    </li>
  </ul>
  <h4 style="color: ${colors.red}">الالتزام بالتعليمــــــات :</h4>
  <ul>
    <li>
    يجب على المريض اتباع الخطة العلاجية الموصى بها من قبل .الطبيب أثناء وجوده في المستشفى وبعد الخروج
    </li>
    <li>
    يجب على المريض احترام المواعيد وفي حالة عدم قدرته على
    .الالتزام بالموعد فعليه إخبار المستشفى بذلك
    </li>
  </ul>
  <h4 style="color: ${colors.red}">رفض العلاج:</h4>
  <ul>
    <li>
    يتحمل المريض المسؤولية التامة عن أفعاله إذا قام برفض
    .العلاج ، أو في حالة عدم اتباع تعليمات الطبيب
    </li>
  </ul>
  <h4 style="color: ${colors.red}">مصاريف المستشفى:</h4>
  <ul>
    <li>
    يجب على المريض ضمان الإيفاء بأسرع ما يمكن بالالتزامات
    المالية التي حُدِّدت مقابل الحصول على الرعاية الصحية 
    .وقبل مغادرته للمستشفى
    </li>
  </ul>
</container>
`
      : `
      <container>
      <center>
      <h3>واجبات المرضى</h3>
      </center>
    
      <h3>تشمل واجبات المرضى ما يلي:</h3>
      <h4 style="color: ${colors.red}">توفير المعلومات:</h4>
      <ul>
        <li>
        يجب على المريض أن يذكر لطبيبه التاريخ الصحي الكامل لحالته .والشكوى المرضية الحالية التي قدم من أجلها إلى المستشفى
        </li>
        <li>
        يجب على المريض إطلاع الطبيب المسؤول على التغيرات الطبية .المفاجئة لحالته  
        </li>
        <li>
        يجب على المريض إيضاح ما إذا كان يتفهم الحالة المرضية التي .تم شرحها له من مقدم الخدمة الطبية والعلاج الموصوف له
        </li>
      </ul>
      <h4 style="color: ${colors.red}">الالتزام بالتعليمــــــات :</h4>
      <ul>
        <li>
        يجب على المريض اتباع الخطة العلاجية الموصى بها من قبل .الطبيب أثناء وجوده في المستشفى وبعد الخروج
        </li>
        <li>
        يجب على المريض احترام المواعيد وفي حالة عدم قدرته على
        .الالتزام بالموعد فعليه إخبار المستشفى بذلك
        </li>
      </ul>
      <h4 style="color: ${colors.red}">رفض العلاج:</h4>
      <ul>
        <li>
        يتحمل المريض المسؤولية التامة عن أفعاله إذا قام برفض
        .العلاج ، أو في حالة عدم اتباع تعليمات الطبيب
        </li>
      </ul>
      <h4 style="color: ${colors.red}">مصاريف المستشفى:</h4>
      <ul>
        <li>
        يجب على المريض ضمان الإيفاء بأسرع ما يمكن بالالتزامات
        المالية التي حُدِّدت مقابل الحصول على الرعاية الصحية 
        .وقبل مغادرته للمستشفى
        </li>
      </ul>
    </container>
    `,
  },
  {
    html: I18nManager.isRTL
      ? `
  <container>
  <h4 style="color: ${colors.red}">قواعد وقوانين المستشفى :</h4>
  <ul>
    <li>
    يجب على المريض اتباع قواعد وقوانين المستشفى والالتزام بقواعد السلوك الإيجابي لما لذلك من تأثير كبير في جودة وسلامة .الرعاية المقدمة له
    </li>
  </ul>
  <h4 style="color: ${colors.red}">احترام ومراعاة حقوق الاخرين:</h4>
  <ul>
    <li>
    يجب على المريض التصرف باحترام وأن يراعي حقوق المرضى الآخرين ومجموعةالعاملين بالمستشفى وكذلك يجب عليه التعاون مع المستشفى فيما يخص مستوى الضوضاء والتدخين وأعداد .الزائرين
    </li>
  </ul>
  
</container>
`
      : `
      <container>
      <h4 style="color: ${colors.red}">قواعد وقوانين المستشفى :</h4>
      <ul>
        <li>
        يجب على المريض اتباع قواعد وقوانين المستشفى والالتزام بقواعد السلوك الإيجابي لما لذلك من تأثير كبير في جودة وسلامة .الرعاية المقدمة له
        </li>
      </ul>
      <h4 style="color: ${colors.red}">احترام ومراعاة حقوق الاخرين:</h4>
      <ul>
        <li>
        يجب على المريض التصرف باحترام وأن يراعي حقوق المرضى الآخرين ومجموعةالعاملين بالمستشفى وكذلك يجب عليه التعاون مع المستشفى فيما يخص مستوى الضوضاء والتدخين وأعداد .الزائرين
        </li>
      </ul>
      
    </container>
    `,
  },
];
