import {I18nManager} from 'react-native';
import {colors, HP, images} from '../../../../../../services';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
يجب ارسال أي شيء لا تحتاجه الى المنزل بما في ذلك الأمتعة 
والمجوهرات والأموال والملابس الزائدة عن الحاجة  
</li>
<li>
يرجى حفظ المتعلقات في الخزانة الحديدية بجانب السرير
</li>
<li>
خصصت الخزانة الحديدية لحفظ متعلقاتك الهامة وستجدها
مودوعة بخزانة الملابس بغرفتك وسترشدك مسؤولة خدمات 
الغرف الى طريقة استخدامها 
</li>
<li>
ضع طقم الأسنان أو النظارة البصرية في حقيبة ، لا تلف الأشياء
الصغيرة في مناشف أو مناديل ورقية لأنه قد يتم إلقاؤها في سلة 
المهملات على سبيل الخطأ
</li>
<li>
مستشفى الأطباء المتحدون غير مسؤولة عن سلامة او فقدان 
المتعلقات الشخصية أو الأموال وأجهزة الهاتف النقال
</li>
</ul>
<h4>شريط التعريف في معصم اليد ( سوار المعصم )</h4>
<ul>
<li>
يوضح شريط التعريف اسمك ورقم السجل الطبي الخاص بك ، لا
تنزع هذا الشريط أثناء تواجدك في مستشفى الأطباء المتحدون
</li>
</ul>
<div
      style="
      margin-top:  ${HP('1.5')};
      margin-bottom:  ${HP('1.5')};
      width: 100%;
      height: ${HP('30')}
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      object-fit: fill;
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/Untitled-5.jpg?alt=media&token=3dad9244-3b7c-4afb-b8dd-bc29c0ff98ee" />
      </div>

</container>
`
      : `
      <container>
      <ul>
      <li>
      يجب ارسال أي شيء لا تحتاجه الى المنزل بما في ذلك الأمتعة 
      والمجوهرات والأموال والملابس الزائدة عن الحاجة  
      </li>
      <li>
      يرجى حفظ المتعلقات في الخزانة الحديدية بجانب السرير
      </li>
      <li>
      خصصت الخزانة الحديدية لحفظ متعلقاتك الهامة وستجدها
      مودوعة بخزانة الملابس بغرفتك وسترشدك مسؤولة خدمات 
      الغرف الى طريقة استخدامها 
      </li>
      <li>
      ضع طقم الأسنان أو النظارة البصرية في حقيبة ، لا تلف الأشياء
      الصغيرة في مناشف أو مناديل ورقية لأنه قد يتم إلقاؤها في سلة 
      المهملات على سبيل الخطأ
      </li>
      <li>
      مستشفى الأطباء المتحدون غير مسؤولة عن سلامة او فقدان 
      المتعلقات الشخصية أو الأموال وأجهزة الهاتف النقال
      </li>
      </ul>
      <h4>شريط التعريف في معصم اليد ( سوار المعصم )</h4>
      <ul>
      <li>
      يوضح شريط التعريف اسمك ورقم السجل الطبي الخاص بك ، لا
      تنزع هذا الشريط أثناء تواجدك في مستشفى الأطباء المتحدون
      </li>
      </ul>
      <div
            style="
            margin-top:  ${HP('1.5')};
            margin-bottom:  ${HP('1.5')};
            width: 100%;
            height: ${HP('30')}
            "
            >
            <img 
            style="
            width: 100%;
            height: 100%;
            object-fit: fill;
            "
            src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/Untitled-5.jpg?alt=media&token=3dad9244-3b7c-4afb-b8dd-bc29c0ff98ee" />
            </div>
      
      </container>
      `,
  },
];
