import {I18nManager, Platform} from 'react-native';
import {colors, fontFamilies, HP, images} from '../../../../../../services';
import {
  smallScreens,
  WP,
} from '../../../../../../services/utilities/responsive';

export default [
  {
    html: I18nManager.isRTL
      ? `
  <container>
  <center>
  <h3>حقوق المرضى</h3>
  </center>

  <h4 style="color: ${colors.green};">تشمل حقوق المرضى ما يلي:</h4>
  <p>إدراكاً منا بأن كل مريض هو فرد مستقل بذاته وله احتياجاته الخاصة من الرعاية الصحية ، نسعى في مستشفى الأطباء المتحدون لتوفير كامل الرعاية الصحية التي يحتاجها المريض ونستجيب لمطالب واحتياجات المرضى فيما يختص بالخدمة وذلك في حدود ما تتيحه إمكانات المستشفى . إنه الهدف الرئيسي الذي يسعى المستشفى لتحقيقه وتنظمه السياسات والقوانين والضوابط المطبقة بداخله. وقد تم نشر لوحات توضح حقوق المرضى في سائر ارجاء المشفى </p>
  <img
  style="width: 100%; height: ${HP('15')}; align-self: center; margin-top: ${HP(
          '1.5',
        )};"
  src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/Untitled-6.jpg?alt=media&token=11113967-8b73-4a2e-8a93-3469ad7823d2"
/>
  <h4 style="color: ${colors.green}">الحصول على الرعاية :</h4>
  <ul>
  <li> يجب أن لا يحرم المريض من الرعاية الملائمة على أساس العِرق أو الدين أو العادات أو اللون أو الجنسية أو الأصل أو الجنس أو السن أو الإعاقة أو الحالة الزوجية أو مصدر الدخل أو نوع تغطية التكاليف العلاجية . سيحصل جميع المرضى على علاج طبي متساوٍ بالنسبة لنفس التشخيص واحتياجات الرعاية الصحية</li>
  <li> يتمتع المريض بحق المطالبة بالرعاية الإضافية في حال إعاقته 
  .مثل الكراسي المتحركة أو ما إلى ذلك ، وذلك لتعويض إعاقته</li>
</ul>
</container>
`
      : `
      <container>
      <center>
      <h3>Patient Rights</h3>
      </center>
    
      <h4 style="color: ${colors.green}; font-family: ${fontFamilies(
          'boldText',
        )}">Patient Rights include:</h4>
      <p>Realizing that ever patient is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged </p>
      <img
      style="width: 100%; height: ${HP(
        '15',
      )}; align-self: center; margin-top: ${HP('1.5')}; margin-bottom:${HP(
          '1.5',
        )};"
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/Untitled-6.jpg?alt=media&token=11113967-8b73-4a2e-8a93-3469ad7823d2"
    />
      <h4 style="color: ${colors.green}">الحصول على الرعاية :</h4>
      <ul>
      <li> يجب أن لا يحرم المريض من الرعاية الملائمة على أساس العِرق أو الدين أو العادات أو اللون أو الجنسية أو الأصل أو الجنس أو السن أو الإعاقة أو الحالة الزوجية أو مصدر الدخل أو نوع تغطية التكاليف العلاجية . سيحصل جميع المرضى على علاج طبي متساوٍ بالنسبة لنفس التشخيص واحتياجات الرعاية الصحية</li>
      <li> يتمتع المريض بحق المطالبة بالرعاية الإضافية في حال إعاقته 
      .مثل الكراسي المتحركة أو ما إلى ذلك ، وذلك لتعويض إعاقته</li>
    </ul>
    </container>
    `,
  },
  {
    html: I18nManager.isRTL
      ? `
  <container>
  <h4 style="color: ${colors.green}"> الإحترام:</h4>
  <ul>
  <li>ستتم معالجة المريض مع المراعاة والاحترام وكامل التقدير لكرامته
  وشخصيته المستقلة ، بما في ذلك الخصوصية في العلاج
   والرعاية
  .الشخصية ، خاصة المرضى من ذوي الاحتياجات الخاصة</li>
  <li> لن يتعرض المريض لأي نوع من أنواع الإيذاء الجسدي أو التحرش
  الجنسي</li>
  <li>كما لن يسمح بمعاملة المريض بشكل غير لائق من قبل أي شخص</li>
  </ul>   
  <h4 style="color: ${colors.green}">الأمن والسلامة:</h4>
  <ul>
  <li>للمريض الحق في توقع أفضل مستوى ممكن من السلامة فيما يتعلق ببيئة المستشفى والسلوك المتبع في الإجراءات الطبية . وكذلك حمايته كمريض بغض النظر عن فئته العمرية من التعرض للمضايقات أو العنف أو الإيذاء</li>
  <li> كما يوفر المستشفى حماية خاصة للمواليد الجدد عبر تطبيق أفضل
  .معايير الأمن والسلامة المطبقة في هذا الشأن</li>
  </ul>
  <h4 style="color: ${colors.green}">المعلومات:</h4>
  <ul>
  <li> سيتم إخطار المرضى في صيغة شفهية بكامل حقوقهم ومسؤولياتهم
  .وما يترتب على ذلك من نتائج</li>
  <li>سيتم إخطار المريض بكل ما يتعلق بحالته الصحية ، وذلك عن طريق الموظف المختص بتقديم الخدمة </li>
  <li> سيتم إخطار المريض بكل شيء عن التزاماته المالية التي يمكن
  تحديدها مسبقاً وما قد يضاف إليها لاحقاً من خدمات قد تستدعيها
  .ضرورة العلاج</li>
  </ul>
</container>
`
      : `
      <container>
      <h4 style="color: ${colors.green}"> الإحترام:</h4>
      <ul>
      <li>ستتم معالجة المريض مع المراعاة والاحترام وكامل التقدير لكرامته
      وشخصيته المستقلة ، بما في ذلك الخصوصية في العلاج
       والرعاية
      .الشخصية ، خاصة المرضى من ذوي الاحتياجات الخاصة</li>
      <li> لن يتعرض المريض لأي نوع من أنواع الإيذاء الجسدي أو التحرش
      الجنسي</li>
      <li>كما لن يسمح بمعاملة المريض بشكل غير لائق من قبل أي شخص</li>
      </ul>   
      <h4 style="color: ${colors.green}">الأمن والسلامة:</h4>
      <ul>
      <li>للمريض الحق في توقع أفضل مستوى ممكن من السلامة فيما يتعلق ببيئة المستشفى والسلوك المتبع في الإجراءات الطبية . وكذلك حمايته كمريض بغض النظر عن فئته العمرية من التعرض للمضايقات أو العنف أو الإيذاء</li>
      <li> كما يوفر المستشفى حماية خاصة للمواليد الجدد عبر تطبيق أفضل
      .معايير الأمن والسلامة المطبقة في هذا الشأن</li>
      </ul>
      <h4 style="color: ${colors.green}">المعلومات:</h4>
      <ul>
      <li> سيتم إخطار المرضى في صيغة شفهية بكامل حقوقهم ومسؤولياتهم
      .وما يترتب على ذلك من نتائج</li>
      <li>سيتم إخطار المريض بكل ما يتعلق بحالته الصحية ، وذلك عن طريق الموظف المختص بتقديم الخدمة </li>
      <li> سيتم إخطار المريض بكل شيء عن التزاماته المالية التي يمكن
      تحديدها مسبقاً وما قد يضاف إليها لاحقاً من خدمات قد تستدعيها
      .ضرورة العلاج</li>
      </ul>
    </container>
    `,
  },
  {
    html: I18nManager.isRTL
      ? `
  <container>
    <ul>
    <li> سيتم إخطار المريض بأمانة في حالة ما إذا كانت احتياجاته تتخطى
    .إمكانات الرعاية بالمستشفى </li>
    </ul>
  <h4 style="color: ${colors.green}">الإتصال:</h4>
  <ul>
<li>يجب أن يكون للمريض حرية الاتصال بأي شخص أو مرافقته أو مقابلته على انفراد بما في ذلك أفراد العائلة والأصدقاء ، في حدود احترام حقوق الآخرين</li>
  <li> كما يتم توفير المترجمين للمريض إذا لم يكن بإمكانه فهم اللغة
  .التي يتحدثها الشخص القائم على رعايته</li>
  </ul>   
  <h4 style="color: ${colors.green}">الخصوصية:</h4>
  <ul>
  <li> للمريض الحق في أن تكون له خصوصيته الشخصية ويجب أن
  .يتمتع بالحق في تفضيل الزيارة من عدمها</li>
<li> للمريض الحق في أن تتم مقابلته وفحصه على انفراد أو أن يختار
.مرافقاً يتواجد أثناء إجراء الفحوص الجسدية عليه</li>
  </ul>
  <h4 style="color: ${colors.green}">السرية:</h4>
  <ul>
 <li>يجب الحصول على موافقة كتابية من المريض قبل تصويره ( خاصة تصوير الوجه )  </li>
 <li> يجب ضمان التعامل بسرية مع جميع بيانات المريض الموجودة في
 ملفه الطبي عن طريق عدم مناقشة بياناته أمام الآخرين فيما يخص
 هذه البيانات وعدم الإفصاح عن اسمه عند الحديث عن أي
 .معلومات متعلقه بمرضه</li>
 <li> .للمريض الحق في الحصول على تقرير طبي</li>
 <li> يجب الحصول على تفويض مكتوب من المريض قبل إعطاء أي
 .معلومات عن حالته الراهنة لأي شخص</li>
  </ul>
</container>
`
      : `
      <container>
        <ul>
        <li> سيتم إخطار المريض بأمانة في حالة ما إذا كانت احتياجاته تتخطى
        .إمكانات الرعاية بالمستشفى </li>
        </ul>
      <h4 style="color: ${colors.green}">الإتصال:</h4>
      <ul>
    <li>يجب أن يكون للمريض حرية الاتصال بأي شخص أو مرافقته أو مقابلته على انفراد بما في ذلك أفراد العائلة والأصدقاء ، في حدود احترام حقوق الآخرين</li>
      <li> كما يتم توفير المترجمين للمريض إذا لم يكن بإمكانه فهم اللغة
      .التي يتحدثها الشخص القائم على رعايته</li>
      </ul>   
      <h4 style="color: ${colors.green}">الخصوصية:</h4>
      <ul>
      <li> للمريض الحق في أن تكون له خصوصيته الشخصية ويجب أن
      .يتمتع بالحق في تفضيل الزيارة من عدمها</li>
    <li> للمريض الحق في أن تتم مقابلته وفحصه على انفراد أو أن يختار
    .مرافقاً يتواجد أثناء إجراء الفحوص الجسدية عليه</li>
      </ul>
      <h4 style="color: ${colors.green}">السرية:</h4>
      <ul>
     <li>يجب الحصول على موافقة كتابية من المريض قبل تصويره ( خاصة تصوير الوجه )  </li>
     <li> يجب ضمان التعامل بسرية مع جميع بيانات المريض الموجودة في
     ملفه الطبي عن طريق عدم مناقشة بياناته أمام الآخرين فيما يخص
     هذه البيانات وعدم الإفصاح عن اسمه عند الحديث عن أي
     .معلومات متعلقه بمرضه</li>
     <li> .للمريض الحق في الحصول على تقرير طبي</li>
     <li> يجب الحصول على تفويض مكتوب من المريض قبل إعطاء أي
     .معلومات عن حالته الراهنة لأي شخص</li>
      </ul>
    </container>
    `,
  },
  {
    html: I18nManager.isRTL
      ? `
  <container>
  <h4 style="color: ${colors.green}">الموافقة على العلاج ورفضه:</h4>
  <ul>
<li>
للمريض الحق في اتخاذ القرارات فيما يتعلق برعايته بناءً على المعلومات التي يحصل عليها من الموظف المختص بتقديم الخدمة يشمل ذلك المعلومات المتعلقة بالإجراء المقرر اتخاذه والمخاطر 
</li>
<li>
المحتملة والفوائد والإجراءات الإضافية التي قد يكون من الضروري اتخاذها والعواقب طويلة الأمد والمخاطر التي قد تنجم عن عدم الحصول على العلاج والطرق العلاجية البديلة الممكنة والمتاحة ، بما في ذلك خيار العلاج غير المتاح بالمستشفى
</li>
<li>
هذا إذا كانت الحالة العقلية للمريض تسمح له باتخاذ هذه
القرارات ، كذلك من حق المريض أن يرفض ذلك العلاج وأن يتم
.إخطاره بالعواقب الطبية لهذا الرفض
</li>
  </ul>   
  <h4 style="color: ${colors.green}">البديل في اتخاذ القرارات:</h4>
  <ul>
  <li>
  للمريض الحق في إخطار مقدم الرعاية الصحية له بقراره المتخذ
  سلفاً فيما يتعلق برعايته الصحية والذي ينبغي العمل به في حالة
  .فقدانه للقدرة على اتخاذ القرار
  </li>
  <li>
  عند دخول المريض للمستشفى ، يكون لديه الحق في تعيين شخص
  بديل يقوم باتخاذ القرارات المتعلقة برعايته الصحية نيابة عنه وفي
  حدود ما يسمح به النظام ، ذلك في حال لم تكن لديه القدرة على
  .اتخاذ القرار
  </li>

  </ul>
  <h4 style="color: ${colors.green}">الشكاوي والتساؤلات:</h4>
  <ul>
 <li>
 للمريض الحق في تقديم الشكاوى في المدة المحددة وفق نظام المستشفى فيما يتعلق بأي شكل من أشكال الرعاية أو الخدمة دون .التعرض لأي قيود أو تدخل أو إكراه أو تمييز
 </li>
 <li>
 .للمريض الحق في أن يتم إخطاره بما يخص مسار شكواه
 </li>
  </ul>
</container>
`
      : `
      <container>
      <h4 style="color: ${colors.green}">الموافقة على العلاج ورفضه:</h4>
      <ul>
    <li>
    للمريض الحق في اتخاذ القرارات فيما يتعلق برعايته بناءً على المعلومات التي يحصل عليها من الموظف المختص بتقديم الخدمة يشمل ذلك المعلومات المتعلقة بالإجراء المقرر اتخاذه والمخاطر 
    </li>
    <li>
    المحتملة والفوائد والإجراءات الإضافية التي قد يكون من الضروري اتخاذها والعواقب طويلة الأمد والمخاطر التي قد تنجم عن عدم الحصول على العلاج والطرق العلاجية البديلة الممكنة والمتاحة ، بما في ذلك خيار العلاج غير المتاح بالمستشفى
    </li>
    <li>
    هذا إذا كانت الحالة العقلية للمريض تسمح له باتخاذ هذه
    القرارات ، كذلك من حق المريض أن يرفض ذلك العلاج وأن يتم
    .إخطاره بالعواقب الطبية لهذا الرفض
    </li>
      </ul>   
      <h4 style="color: ${colors.green}">البديل في اتخاذ القرارات:</h4>
      <ul>
      <li>
      للمريض الحق في إخطار مقدم الرعاية الصحية له بقراره المتخذ
      سلفاً فيما يتعلق برعايته الصحية والذي ينبغي العمل به في حالة
      .فقدانه للقدرة على اتخاذ القرار
      </li>
      <li>
      عند دخول المريض للمستشفى ، يكون لديه الحق في تعيين شخص
      بديل يقوم باتخاذ القرارات المتعلقة برعايته الصحية نيابة عنه وفي
      حدود ما يسمح به النظام ، ذلك في حال لم تكن لديه القدرة على
      .اتخاذ القرار
      </li>
    
      </ul>
      <h4 style="color: ${colors.green}">الشكاوي والتساؤلات:</h4>
      <ul>
     <li>
     للمريض الحق في تقديم الشكاوى في المدة المحددة وفق نظام المستشفى فيما يتعلق بأي شكل من أشكال الرعاية أو الخدمة دون .التعرض لأي قيود أو تدخل أو إكراه أو تمييز
     </li>
     <li>
     .للمريض الحق في أن يتم إخطاره بما يخص مسار شكواه
     </li>
      </ul>
    </container>
    `,
  },
  {
    html: I18nManager.isRTL
      ? `
  <container>
  <ul>
    <li>
وكذلك للمريض الحق في أن يتم استعراض شكواه في الوقت المناسب وبشكل عادل وحصوله على رد بالقرار الذي توصل إليه .المستشفى بشأن شكواه
    </li>
    <li>
يتمتع المريض بالحق في طرح التساؤلات وحصوله على .الإجابات وفقاً لذلك
    </li>
</ul>  
  <h4 style="color: ${colors.green}">القيود:</h4>
  <ul>
    <li>
    يجب ألا يتعرض المريض لقيود دوائية وجسدية إلا إذا اعتقد الأطباء أن ذلك الإجراء ضروري لحماية المريض أو لحماية الآخرين على أن يكون تصريح الأطباء بذلك كتابياً وبإشراف طبي متكامل ومتواصل ولفترة زمنية محددة .
    </li>
  </ul>
  <h4 style="color: ${colors.green}">التحويل او الخروج:</h4>
  <ul>
    <li>
    يجب أن يكون تحويل أو خروج المريض من المستشفى بعد وضع خطة ملائمة للخروج ولأسباب طبية فقط .
    </li>
    <li>
    يجب إخطار المريض بأسباب التحويل وبالإجراءات المتخذة لتسهيل عملية التحويل
    </li>
  </ul>
</container>
`
      : `
      <container>
      <ul>
        <li>
    وكذلك للمريض الحق في أن يتم استعراض شكواه في الوقت المناسب وبشكل عادل وحصوله على رد بالقرار الذي توصل إليه .المستشفى بشأن شكواه
        </li>
        <li>
    يتمتع المريض بالحق في طرح التساؤلات وحصوله على .الإجابات وفقاً لذلك
        </li>
    </ul>  
      <h4 style="color: ${colors.green}">القيود:</h4>
      <ul>
        <li>
        يجب ألا يتعرض المريض لقيود دوائية وجسدية إلا إذا اعتقد الأطباء أن ذلك الإجراء ضروري لحماية المريض أو لحماية الآخرين على أن يكون تصريح الأطباء بذلك كتابياً وبإشراف طبي متكامل ومتواصل ولفترة زمنية محددة .
        </li>
      </ul>
      <h4 style="color: ${colors.green}">التحويل او الخروج:</h4>
      <ul>
        <li>
        يجب أن يكون تحويل أو خروج المريض من المستشفى بعد وضع خطة ملائمة للخروج ولأسباب طبية فقط .
        </li>
        <li>
        يجب إخطار المريض بأسباب التحويل وبالإجراءات المتخذة لتسهيل عملية التحويل
        </li>
      </ul>
    </container>
    `,
  },
];
