import {I18nManager, Platform} from 'react-native';
import {colors, HP, images, WP} from '../../../../../../services';
import {smallScreens} from '../../../../../../services/utilities/responsive';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>الزوار</h4>
<ul>
<li>
تضفي زيارة افراد الاسرة والاقارب اشراقة على يومك وتساعدك
أيضا على سرعة الشفاء من المرض أثناء اقامتك في المستشفى
يتمثل هدفنا في توفير البيئة التي تساعدك في الامتثال للشفاء 
وتقديم خبرة إيجابية لك ولزوارك
</li>
<li>
تختلف ساعات الزيارة من وحدة الى  أخرى
</li>
</ul>
<center>
<div
style="
margin-top:  ${HP('1.5')};
margin-bottom:  ${HP('1.5')};
height: ${HP('25')};
width: ${WP('80')};

"
>
<img 
style="
width: 100%;
height: 100%;
"
src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/flower.jpg?alt=media&token=318d3774-c89d-41d4-8220-725f3b9eea1c" />
</div>

<ul style="margin-top: 20px">
<li>
حفاظاً على رعايتك ورعاية الاخرين في الوحدة من المهم عدم
استقبال أكثر من زائرين في جميع الأوقات مع العلم أن لك الحق 
في حفض عدد الزوار وساعات الزيارة 
يرجي استشارة  الممرضة المعنية بك لمعرفة طلبات الزيارة الخاصة
بالعناية المركزة
</li>
<li>
سيسعى طاقم العمل الى تلبية احتياجاتك مع المحافظة على سلامة 
المرضى في المقام الأول 
</li>
</ul>
</container>
`
      : `
<container>
<h4>الزوار</h4>
<ul>
<li>
تضفي زيارة افراد الاسرة والاقارب اشراقة على يومك وتساعدك
أيضا على سرعة الشفاء من المرض أثناء اقامتك في المستشفى
يتمثل هدفنا في توفير البيئة التي تساعدك في الامتثال للشفاء 
وتقديم خبرة إيجابية لك ولزوارك
</li>
<li>
تختلف ساعات الزيارة من وحدة الى  أخرى
</li>
</ul>
<center>
<div
            style="
            margin-top:  ${HP('1.5')};
            margin-bottom:  ${HP('1.5')};
            height: ${HP('25')};
            width: ${WP('80')};
            "
            >
            <img 
            style="
            width: 100%;
            height: 100%;
            "
            src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/flower.jpg?alt=media&token=318d3774-c89d-41d4-8220-725f3b9eea1c" />
            </div>

<ul style="margin-top: 20px">
<li>
حفاظاً على رعايتك ورعاية الاخرين في الوحدة من المهم عدم
استقبال أكثر من زائرين في جميع الأوقات مع العلم أن لك الحق 
في حفض عدد الزوار وساعات الزيارة 
يرجي استشارة  الممرضة المعنية بك لمعرفة طلبات الزيارة الخاصة
بالعناية المركزة
</li>
<li>
سيسعى طاقم العمل الى تلبية احتياجاتك مع المحافظة على سلامة 
المرضى في المقام الأول 
</li>
</ul>
</container>
`,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>الغرف الخاصة بك</h4>
<ul>
<li>
يتم تخصيص غرفة تلائم كافة احتياجاتك . نبذل قصارى 
جهدنا لنوفر لك درجة الغرفة التي تطلبها ، في حالة عدم مناسبة
غرفتك يمكنك طلب نقلك من هذه الغرفة الى غرفة أخرى عندما
يكون دلك متاحاً
</li>
<li>
قد يستلزم الامر أحيانا عزل لمريض معين بسبب حالته الطبية في
غرفة مخصصة لذلك
</li>
</ul>
<div
style="
margin-top:  ${HP('1.5')};
margin-bottom:  ${HP('1.5')};
height: ${HP('30')};
width: ${WP('90')};

"
>
<img 
style="
width: 100%;
height: 100%;

"
src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/room2.jpg?alt=media&token=be269cbf-dd2c-4a8e-9e5d-547f9fbe5058" />
</div>
<h4>السرير</h4>
<ul >
<li>
سوف يوضح لك  طاقم التمريض طريقة رفع السرير وخفضه
</li>
<li>
يرجى عدم ترك السرير الا باستشارة الطبيب او الممرضة
</li>
<li>
يمكنك استدعاء الممرضة لضبط ارتفاع السرير 
</li>
<li>
يجب ان يكون السرير في الوضع المنخفض عند النوم او 
الاستيقاظ
</li>
</ul>
</container>
`
      : `
      <container>
      <h4>الغرف الخاصة بك</h4>
      <ul>
      <li>
      يتم تخصيص غرفة تلائم كافة احتياجاتك . نبذل قصارى 
      جهدنا لنوفر لك درجة الغرفة التي تطلبها ، في حالة عدم مناسبة
      غرفتك يمكنك طلب نقلك من هذه الغرفة الى غرفة أخرى عندما
      يكون دلك متاحاً
      </li>
      <li>
      قد يستلزم الامر أحيانا عزل لمريض معين بسبب حالته الطبية في
      غرفة مخصصة لذلك
      </li>
      </ul>
      <div
      style="
      margin-top:  ${HP('1.5')};
      margin-bottom:  ${HP('1.5')};
      height: ${HP('30')};
      width: ${WP('90')};
      
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/room2.jpg?alt=media&token=be269cbf-dd2c-4a8e-9e5d-547f9fbe5058" />
      </div>
      <h4>السرير</h4>
      <ul >
      <li>
      سوف يوضح لك  طاقم التمريض طريقة رفع السرير وخفضه
      </li>
      <li>
      يرجى عدم ترك السرير الا باستشارة الطبيب او الممرضة
      </li>
      <li>
      يمكنك استدعاء الممرضة لضبط ارتفاع السرير 
      </li>
      <li>
      يجب ان يكون السرير في الوضع المنخفض عند النوم او 
      الاستيقاظ
      </li>
      </ul>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
يمكن لطاقم العمل مساعدتك في ضبط وضع السرير
</li>
<li>
قد يحدد الطبيب او الممرضة رفع أرفف السرير الخاص بك 
نظراً لوجود سبب طبي معين اذا كان الامر لذلك فيرجي عدم
خفض الارفف بنفسك او السماح لاحد الزوار بإجراء ذلك 
</li>
<li>
استخدم خدمة جرس الاستدعاء للوصول الى أفراد طاقم العمل في
حالة الاحتياج للمساعدة 
</li>
</ul>
<h4 style="margin-top: 20">المعلومات المتعلقة بالصلاة</h4>
<ul>
<li>
ستجد في غرفتك علامة تشير الى اتجاه القبلة كما ستجد سجادة 
صلاة ومصحف كما يوجد بالإضافة الى ذلك مسجد بجوار مدخل
الطوارئ مباشرة وأماكن مخصصة للوضوء 
</li>
</ul>
<h4 style="margin-top: 20">جرس الاستدعاء </h4>
<ul>
<li>
سوف يوضح لك طاقم التمريض كيفية استخدام جرس الاستدعاء الى 
غرفتك أو حمامك وبمجرد استخدامك لهده الخاصية سيقوم احد طواقم 
التمريض بالتلبية بأسرع وقت 
</li>
</ul>
</container>
`
      : `
      <container>
      <ul>
      <li>
      يمكن لطاقم العمل مساعدتك في ضبط وضع السرير
      </li>
      <li>
      قد يحدد الطبيب او الممرضة رفع أرفف السرير الخاص بك 
      نظراً لوجود سبب طبي معين اذا كان الامر لذلك فيرجي عدم
      خفض الارفف بنفسك او السماح لاحد الزوار بإجراء ذلك 
      </li>
      <li>
      استخدم خدمة جرس الاستدعاء للوصول الى أفراد طاقم العمل في
      حالة الاحتياج للمساعدة 
      </li>
      </ul>
      <h4 style="margin-top: 20">المعلومات المتعلقة بالصلاة</h4>
      <ul>
      <li>
      ستجد في غرفتك علامة تشير الى اتجاه القبلة كما ستجد سجادة 
      صلاة ومصحف كما يوجد بالإضافة الى ذلك مسجد بجوار مدخل
      الطوارئ مباشرة وأماكن مخصصة للوضوء 
      </li>
      </ul>
      <h4 style="margin-top: 20">جرس الاستدعاء </h4>
      <ul>
      <li>
      سوف يوضح لك طاقم التمريض كيفية استخدام جرس الاستدعاء الى 
      غرفتك أو حمامك وبمجرد استخدامك لهده الخاصية سيقوم احد طواقم 
      التمريض بالتلبية بأسرع وقت 
      </li>
      </ul>
      </container>
      `,
  },
];
