import {I18nManager} from 'react-native';
import {colors, HP, images} from '../../../../../../services';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>عزيزتي الام:</h4>
<p>
هذه بعض الارشادات الخاصة بحضانة الأطفال بالمستشفى والتي
 تساعدك على تفهم نظام العمل بالحضانة
</p>
<ul style="margin-top: 20">
<li>
يمكنك الاتصال بحضانة الأطفال على تحويلة (5704) للاستفسار عن أي معلومات تخص طفلك على مدار 24 ساعة
</li>
<li>
يقوم أطباء الأطفال بالكشف على المواليد بالحضانة يوميا من الساعة (8-10) صباحاً ومن الساعة (4-6) مساءً ولذلك نأمل عدم طلب طفلك للحضور الى الغرفة في هذه الاثناء لضمان تلقيه العناية الكاملة من قبل الأطباء المتواجدين
</li>
<li>
يقوم أطباء الأطفال بالمرور على غرفة الام خلال 24 ساعة من الولادة لاطلاع الأم على حالة المولود والرد على أي استفسار لديها
</li>
<li>
عند الرغبة في اجراء طهور لمولودك الذكر أو ثقب أذن لمولودتك الأنثى قبل الخروج من المستشفى على الاب ان يتوجه الى الحضانة بالدور الخامس لتعبئة الأوراق المطلوبة لذلك
</li>
<li>
ينصح أصباء الأطفال بالرضاعة الطبيعية في الساعات الأولى بعد الولادة وذلك لزيادة مناعة المولود ضد الأمراض
</li>
<li>
اثناء تواجد المولود في غرفة الام تكون الأم مسؤولة عنه مسؤولية كاملة
</li>
</ul>

</container>
`
      : `
      <container>
      <h4>عزيزتي الام:</h4>
      <p>
      هذه بعض الارشادات الخاصة بحضانة الأطفال بالمستشفى والتي
       تساعدك على تفهم نظام العمل بالحضانة
      </p>
      <ul style="margin-top: 20">
      <li>
      يمكنك الاتصال بحضانة الأطفال على تحويلة (5704) للاستفسار عن أي معلومات تخص طفلك على مدار 24 ساعة
      </li>
      <li>
      يقوم أطباء الأطفال بالكشف على المواليد بالحضانة يوميا من الساعة (8-10) صباحاً ومن الساعة (4-6) مساءً ولذلك نأمل عدم طلب طفلك للحضور الى الغرفة في هذه الاثناء لضمان تلقيه العناية الكاملة من قبل الأطباء المتواجدين
      </li>
      <li>
      يقوم أطباء الأطفال بالمرور على غرفة الام خلال 24 ساعة من الولادة لاطلاع الأم على حالة المولود والرد على أي استفسار لديها
      </li>
      <li>
      عند الرغبة في اجراء طهور لمولودك الذكر أو ثقب أذن لمولودتك الأنثى قبل الخروج من المستشفى على الاب ان يتوجه الى الحضانة بالدور الخامس لتعبئة الأوراق المطلوبة لذلك
      </li>
      <li>
      ينصح أصباء الأطفال بالرضاعة الطبيعية في الساعات الأولى بعد الولادة وذلك لزيادة مناعة المولود ضد الأمراض
      </li>
      <li>
      اثناء تواجد المولود في غرفة الام تكون الأم مسؤولة عنه مسؤولية كاملة
      </li>
      </ul>
      
      </container>
      `,
  },
];
