import {I18nManager} from 'react-native';
import {colors, HP, images} from '../../../../../../services';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>بنك الدم</h4>
<ul>
<li>
يتوافر في مستشفى الأطباء المتحدون بنك للدم في خدمتك ونرحب بتبرعات عائلتك واصدقائك يتم تخصيص تبرعات الأسرة و الأصدقاء من الدم الملائم لك عند الاحتياج له بشرط موافقة الطبيب المعني بك
</li>
</ul>
<h4 style="margin-top: 20">الملفات الطبية</h4>
<ul>
<li>
تتمتع الملفات الطبية بالسرية التامة ولا يسمح بالاطلاع عليها الا للمريض والأشخاص المرخص لهم بذلك ، يمكن للمريض الحصول على نسخة من سجله الطبي بتعبئة نموذج الترخيص والتوقيع عليه في الوحدة قبل الخروج من المستشفى
</li>
</ul>
<h4 style="margin-top: 10">الجرائد والصحف</h4>
<ul>
<li>
يتم توزيع الجرائد المحلية على الغرف صباح كل يوم 
</li>
</ul>
<div
style="
margin-top:  ${HP('1.5')};
margin-bottom:  ${HP('1.5')};
width: 100%;
height: ${HP('25')}
"
>
<img 
style="
width: 100%;
height: 100%;
object-fit: fill;
"
src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/newspaper.jpg?alt=media&token=2b57c68f-2fca-460c-88d6-4f8ad22b8b6f" />
</div>
</container>
`
      : `
      <container>
      <h4>بنك الدم</h4>
      <ul>
      <li>
      يتوافر في مستشفى الأطباء المتحدون بنك للدم في خدمتك ونرحب بتبرعات عائلتك واصدقائك يتم تخصيص تبرعات الأسرة و الأصدقاء من الدم الملائم لك عند الاحتياج له بشرط موافقة الطبيب المعني بك
      </li>
      </ul>
      <h4 style="margin-top: 20">الملفات الطبية</h4>
      <ul>
      <li>
      تتمتع الملفات الطبية بالسرية التامة ولا يسمح بالاطلاع عليها الا للمريض والأشخاص المرخص لهم بذلك ، يمكن للمريض الحصول على نسخة من سجله الطبي بتعبئة نموذج الترخيص والتوقيع عليه في الوحدة قبل الخروج من المستشفى
      </li>
      </ul>
      <h4 style="margin-top: 10">الجرائد والصحف</h4>
      <ul>
      <li>
      يتم توزيع الجرائد المحلية على الغرف صباح كل يوم 
      </li>
      </ul>
      <div
      style="
      margin-top:  ${HP('1.5')};
      margin-bottom:  ${HP('1.5')};
      width: 100%;
      height: ${HP('25')}
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      object-fit: fill;
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/newspaper.jpg?alt=media&token=2b57c68f-2fca-460c-88d6-4f8ad22b8b6f" />
      </div>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>الصيدلية</h4>
<ul>
<li>
يمكنك طلب الوصفات الطبية المقررة قبل مغادرة المستشفى
من الصيدلية التابعة للمستشفى
</li>
<li>
تقع الصيدلة الخارجية في الطابق الأرضي وتعمل على مدار 24
ساعة وكل أيام الاسبوع
</li>
<li>
في حالة الرغبة في طلب الصيدلية يمكنك الاتصال على الأرقام
التالية 1262-1263- 1265
</li>
</ul>
<div style="margin-top: 15">
<h4 >العودة الى المنزل</h4>
</div>
<h4 style="margin-top: 10">التخطيط</h4>
<ul>
<li>
عندما يحين موعد مغادرتك ، سوف يكتب لك الطبيب ادن الخروج سيساعد فريق الرعاية الصحية في الاستعداد لمغادرة المستشفى وسيقدمون لك ولأفراد عائلتك إرشادات حول كيفية الاعتناء بنفسك في المنزل
</li>
</ul>
<h4 style="margin-top: 20">الخروج من المستشفى</h4>
<ul>
<li>
عند الاستعداد للمغادرة -وفور وصول سيارتك - تساعدك الممرضة المعنية بك أو افراد طاقم العمل الاخرين في جميع متعلقاتك و مصاحباتك الى الردهة الرئيسية ادا كنت بحاجة لدلك
</li>
</ul>
<h4 style="margin-top: 20">الدعامات والأجهزة والأدوية والارشادات</h4>
<ul>
<li>
تساعدك الممرضة أو أفراد طاقم العمل الاخرين في اجراء الترتيبات للحصول على الادوية أو الأجهزة أو الدعامات الخاصة والنوية اتي تناسبك والجهات التي توفرها
</li>
</ul>
</container>
`
      : `
      <container>
      <h4>الصيدلية</h4>
      <ul>
      <li>
      يمكنك طلب الوصفات الطبية المقررة قبل مغادرة المستشفى
      من الصيدلية التابعة للمستشفى
      </li>
      <li>
      تقع الصيدلة الخارجية في الطابق الأرضي وتعمل على مدار 24
      ساعة وكل أيام الاسبوع
      </li>
      <li>
      في حالة الرغبة في طلب الصيدلية يمكنك الاتصال على الأرقام
      التالية 1262-1263- 1265
      </li>
      </ul>
      <div style="margin-top: 15">
      <h4 >العودة الى المنزل</h4>
      </div>
      <h4 style="margin-top: 10">التخطيط</h4>
      <ul>
      <li>
      عندما يحين موعد مغادرتك ، سوف يكتب لك الطبيب ادن الخروج سيساعد فريق الرعاية الصحية في الاستعداد لمغادرة المستشفى وسيقدمون لك ولأفراد عائلتك إرشادات حول كيفية الاعتناء بنفسك في المنزل
      </li>
      </ul>
      <h4 style="margin-top: 20">الخروج من المستشفى</h4>
      <ul>
      <li>
      عند الاستعداد للمغادرة -وفور وصول سيارتك - تساعدك الممرضة المعنية بك أو افراد طاقم العمل الاخرين في جميع متعلقاتك و مصاحباتك الى الردهة الرئيسية ادا كنت بحاجة لدلك
      </li>
      </ul>
      <h4 style="margin-top: 20">الدعامات والأجهزة والأدوية والارشادات</h4>
      <ul>
      <li>
      تساعدك الممرضة أو أفراد طاقم العمل الاخرين في اجراء الترتيبات للحصول على الادوية أو الأجهزة أو الدعامات الخاصة والنوية اتي تناسبك والجهات التي توفرها
      </li>
      </ul>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>رضاء المريض</h4>
<ul>
<li>
نهتم بجودة الإقامة التي يلمسها العملاء في المستشفى
</li>
<li>
في حالة وجود اية استفسارات يرجي الاتصال بالممرضة او قسم علاقات المرضى او الاخصائي الاجتماعي
</li>
<li>
نود ان نطلب منك قبل مغادرة المستشفى تعبئة نموذج قياس الرضا التي يمكنك الحصول عليها وانت في غرفتك يتمتع رايك بالسرية التامة كما ان الإفصاح عن هويتك كتابة هو من الأمور الاختيارية نقيم التعليقات الخاصة بك
</li>
</ul>
<h4 style="margin-top: 20">ماكينات الصراف الالي </h4>
<ul>
<li>
حرصاً على راحتك ، توجد ماكينة الصراف خارج مبني المستشفى بين مدخل الطوارئ والمدخل الرئيسي
</li>
</ul>
<h4 style="margin-top: 20">تسجيل المواليد</h4>
<ul>
<li>
يتم تسجيل المواليد في المستشفى قبل يوم عودة الام الى المنزل و سوف يساعدك طاقم العمل بما تحتاجه لأجراء تسجيل المولود الجديد
</li>
<li>
ولسهولة الخدمات يرجى تقديم المستندات التالية لطاقم العمل في قسم التقارير الطبيبة
</li>
<li>
<span style="color: ${colors.red}">بالنسبة للسعوديين:</span> بطاقة العائلة (الأصل )
</li>
<li>
<span style="color: ${colors.red}">بالنسبة لغير السعوديين:</span> جواز السفر / الإقامة / عقد الزواج اصل ادا كانت لها اقامات منفصلة
</li>
<li>
اتباعك لهده التعليمات يسهل عليك استخراج أصل تبلغ الولادة لتوصيلك بطاقم العمل المسؤول عن التقارير الطبية ويمكنك الاتصال بالرقم الداخلي (1404)
</li>
</ul>
</container>
`
      : `
      <container>
      <h4>رضاء المريض</h4>
      <ul>
      <li>
      نهتم بجودة الإقامة التي يلمسها العملاء في المستشفى
      </li>
      <li>
      في حالة وجود اية استفسارات يرجي الاتصال بالممرضة او قسم علاقات المرضى او الاخصائي الاجتماعي
      </li>
      <li>
      نود ان نطلب منك قبل مغادرة المستشفى تعبئة نموذج قياس الرضا التي يمكنك الحصول عليها وانت في غرفتك يتمتع رايك بالسرية التامة كما ان الإفصاح عن هويتك كتابة هو من الأمور الاختيارية نقيم التعليقات الخاصة بك
      </li>
      </ul>
      <h4 style="margin-top: 20">ماكينات الصراف الالي </h4>
      <ul>
      <li>
      حرصاً على راحتك ، توجد ماكينة الصراف خارج مبني المستشفى بين مدخل الطوارئ والمدخل الرئيسي
      </li>
      </ul>
      <h4 style="margin-top: 20">تسجيل المواليد</h4>
      <ul>
      <li>
      يتم تسجيل المواليد في المستشفى قبل يوم عودة الام الى المنزل و سوف يساعدك طاقم العمل بما تحتاجه لأجراء تسجيل المولود الجديد
      </li>
      <li>
      ولسهولة الخدمات يرجى تقديم المستندات التالية لطاقم العمل في قسم التقارير الطبيبة
      </li>
      <li>
      <span style="color: ${colors.red}">بالنسبة للسعوديين:</span> بطاقة العائلة (الأصل )
      </li>
      <li>
      <span style="color: ${colors.red}">بالنسبة لغير السعوديين:</span> جواز السفر / الإقامة / عقد الزواج اصل ادا كانت لها اقامات منفصلة
      </li>
      <li>
      اتباعك لهده التعليمات يسهل عليك استخراج أصل تبلغ الولادة لتوصيلك بطاقم العمل المسؤول عن التقارير الطبية ويمكنك الاتصال بالرقم الداخلي (1404)
      </li>
      </ul>
      </container>
      `,
  },
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>الشكاوي</h4>
<ul>
<li>
نبذل أقصى ما في وسعنا لتوفير أعلى مستويات الخدمات الطبية والتمريضية والخدمات الأخرى غير أننا في حالة اذا لم نف بتوقعاتك يرجي عدم التردد في ممارسة حقك في الشكوى لادارة المستشفى
</li>
<li>
اذا كان لديك أي تعليق يمكنك الاتصال بالأخصائي الاجتماعي /قسم علاقات المرضى على الرقم الداخلي (1515/2805 ) أو المدير المناب على الرقم (1339) كما ويمكنك إيداع الشكوى او الاقتراح الكترونيا من خلال الصندوق الالكتروني للاقتراحات والشكاوى بالردهة الرئيسية واستقبال الطوارئ
</li>
</ul>
<h4 style="margin-top: 20">معرفة قيمة الفاتورة الخاصة بك</h4>
<ul>
<li>
تحتوي الفاتورة الصادة عن مستشفى الأطباء المتحدون على تكاليف التحاليل والاختبارات التي طلبها الطبيب وكدلك تكاليف الغرفة و الرعاية التمريضية في حالة ادا أردت ان تدفع قيمة الفاتورة نقداً فان لك الحق في الحصول على الفاتورة المفصلة وسوف يعد المسؤول عن الخروج هده الفاتورة لك ، في حالة ادا كنت أحد المرضى التابعين لإحدى شركات التامين فلشركة التامين الحق في الحصول على الفواتير التفصيلية
</li>
</ul>
<h4 style="margin-top: 20"> الخيارات الخاصة بمواصلة الرعاية</h4>
<ul>
<li>
بعد خروجك من المستشفى قد تحتاج الى مواصلة العلاج في أماكن أخرى وسوف يساعدك الاخصائي الاجتماعي على اجراء هده الترتيبات كما سيناقش معك خطط الخروج من المستشفى والخيارات المتاحة
</li>
</ul>
</container>
`
      : `
      <container>
      <h4>الشكاوي</h4>
      <ul>
      <li>
      نبذل أقصى ما في وسعنا لتوفير أعلى مستويات الخدمات الطبية والتمريضية والخدمات الأخرى غير أننا في حالة اذا لم نف بتوقعاتك يرجي عدم التردد في ممارسة حقك في الشكوى لادارة المستشفى
      </li>
      <li>
      اذا كان لديك أي تعليق يمكنك الاتصال بالأخصائي الاجتماعي /قسم علاقات المرضى على الرقم الداخلي (1515/2805 ) أو المدير المناب على الرقم (1339) كما ويمكنك إيداع الشكوى او الاقتراح الكترونيا من خلال الصندوق الالكتروني للاقتراحات والشكاوى بالردهة الرئيسية واستقبال الطوارئ
      </li>
      </ul>
      <h4 style="margin-top: 20">معرفة قيمة الفاتورة الخاصة بك</h4>
      <ul>
      <li>
      تحتوي الفاتورة الصادة عن مستشفى الأطباء المتحدون على تكاليف التحاليل والاختبارات التي طلبها الطبيب وكدلك تكاليف الغرفة و الرعاية التمريضية في حالة ادا أردت ان تدفع قيمة الفاتورة نقداً فان لك الحق في الحصول على الفاتورة المفصلة وسوف يعد المسؤول عن الخروج هده الفاتورة لك ، في حالة ادا كنت أحد المرضى التابعين لإحدى شركات التامين فلشركة التامين الحق في الحصول على الفواتير التفصيلية
      </li>
      </ul>
      <h4 style="margin-top: 20"> الخيارات الخاصة بمواصلة الرعاية</h4>
      <ul>
      <li>
      بعد خروجك من المستشفى قد تحتاج الى مواصلة العلاج في أماكن أخرى وسوف يساعدك الاخصائي الاجتماعي على اجراء هده الترتيبات كما سيناقش معك خطط الخروج من المستشفى والخيارات المتاحة
      </li>
      </ul>
      </container>
      `,
  },
];
