import {I18nManager} from 'react-native';
import {colors, HP, images} from '../../../../../../services';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>نماذج الموافقة</h4>
<ul>
<li>
قد يطلب منك التوقيع على نماذج الموافقة على أنواع معينة من 
العلاج والاختبارات والإجراءات وسوف يوضح لك الطبيب هذه
الاختبارات او الإجراءات في حالة عدم معرفتك بالأجراء  او 
الاختبار الذي سيطلب منك الموافقة عليه اخبر الممرضة المعنية
بك وسيتم ابلاغ الطبيب من المهم لك معرفة المخاطر والفوائد 
والبدائل المتاحة لك عندما تخضع لأي اجراء عدا التحاليل
العادية (مثل : تحليل الدم ) او الإجراءات العلاجية المعتادة
(مثل :قيام الممرضة بحقن المحاليل الوريدية ) 
</li>

</ul>

</container>
`
      : `
      <container>
      <h4>نماذج الموافقة</h4>
      <ul>
      <li>
      قد يطلب منك التوقيع على نماذج الموافقة على أنواع معينة من 
      العلاج والاختبارات والإجراءات وسوف يوضح لك الطبيب هذه
      الاختبارات او الإجراءات في حالة عدم معرفتك بالأجراء  او 
      الاختبار الذي سيطلب منك الموافقة عليه اخبر الممرضة المعنية
      بك وسيتم ابلاغ الطبيب من المهم لك معرفة المخاطر والفوائد 
      والبدائل المتاحة لك عندما تخضع لأي اجراء عدا التحاليل
      العادية (مثل : تحليل الدم ) او الإجراءات العلاجية المعتادة
      (مثل :قيام الممرضة بحقن المحاليل الوريدية ) 
      </li>
      
      </ul>
      
      </container>
      `,
  },
];
