import {I18nManager, Platform} from 'react-native';
import {colors, HP, images} from '../../../../../../services';
import {smallScreens} from '../../../../../../services/utilities/responsive';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<ul>
<li>
يتم تقديم ثلاث  وجبات يوميا وتختلف مواعيد تقديمها في أجنحة 
المستشفى 
</li>
<li>
سوف تتسلم قائمة بأفضل الأطعمة التي يتم تقديمها في الإفطار
الغداء العشاء 
</li>
<li>
سوف يخبرك الموظفون المسؤولون عن خدمات الطعام بالمواعيد 
العامة للوجبات وسيساعدونك على اختيار افضل الأطعمة 
</li>
</ul>
<div
style="
margin-top:  ${HP('1.5')};
margin-bottom:  ${HP('1.5')};
width: 100%;
height: ${HP('30')}
"
>
<img 
style="
width: 100%;
height: 100%;
object-fit: fill;
"
src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/food.jpg?alt=media&token=d71dab4d-2dff-4eb9-938f-827e9b72890b" />
</div>

<ul>
<li>
اذا لم تتمكن من تناول وجبتك بسبب اجراء الفحوص او تناول العلاج
يؤمن قسم توزيع الطعام وصول هذه الوجبة فور عودتك ، يتولى 
اخصائي التغذية المسجل او فني التغذية ترتيب الوجبات واختيارها
قد تكون خاضعا لنظام تغذية خاص لذلك استشر الممرضة قبل ان 
تطلب من الزوار ان يأتوا لك بأطعمة من خارج المستشفى ، ان 
المستشفى لا تشجع على تناول الأطعمة الخارجية لذلك يرجى
الاختيار من مجموعة الأطعمة المختلفة والممتازة والموجودة 
في قائمة طعام المستشفى 
</li>
</ul>

</container>
`
      : `
      <container>
      <ul>
      <li>
      يتم تقديم ثلاث  وجبات يوميا وتختلف مواعيد تقديمها في أجنحة 
      المستشفى 
      </li>
      <li>
      سوف تتسلم قائمة بأفضل الأطعمة التي يتم تقديمها في الإفطار
      الغداء العشاء 
      </li>
      <li>
      سوف يخبرك الموظفون المسؤولون عن خدمات الطعام بالمواعيد 
      العامة للوجبات وسيساعدونك على اختيار افضل الأطعمة 
      </li>
      </ul>
      <div
      style="
      margin-top:  ${HP('1.5')};
      margin-bottom:  ${HP('1.5')};
      width: 100%;
      height: ${HP('30')}
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      object-fit: fill;
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/food.jpg?alt=media&token=d71dab4d-2dff-4eb9-938f-827e9b72890b" />
      </div>
      
      <ul>
      <li>
      اذا لم تتمكن من تناول وجبتك بسبب اجراء الفحوص او تناول العلاج
      يؤمن قسم توزيع الطعام وصول هذه الوجبة فور عودتك ، يتولى 
      اخصائي التغذية المسجل او فني التغذية ترتيب الوجبات واختيارها
      قد تكون خاضعا لنظام تغذية خاص لذلك استشر الممرضة قبل ان 
      تطلب من الزوار ان يأتوا لك بأطعمة من خارج المستشفى ، ان 
      المستشفى لا تشجع على تناول الأطعمة الخارجية لذلك يرجى
      الاختيار من مجموعة الأطعمة المختلفة والممتازة والموجودة 
      في قائمة طعام المستشفى 
      </li>
      </ul>
      
      </container>
      `,
  },
];
