import {I18nManager, Platform} from 'react-native';
import {colors, HP, images} from '../../../../../../services';
import {smallScreens} from '../../../../../../services/utilities/responsive';

export default [
  {
    html: I18nManager.isRTL
      ? `
<container>
<h4>الاستحمام</h4>
<ul>
<li>
يمكن للممرضة أو الممرض مساعدتك في الاستحمام او أخذ دش
في صباح كل يوم وذلك   وفقا لمدى قدرتك على المشاركة
</li>
<li>
كما يوجد جرس للاستدعاء بجوار الدش في حالات الطوارئ
</li>
</ul>
<div
style="
margin-top:  ${HP('1.5')};
margin-bottom:  ${HP('1.5')};
width: 100%;
height: ${HP('30')}
"
>
<img 
style="
width: 100%;
height: 100%;
object-fit: fill;
"
src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/bathroom.jpg?alt=media&token=f04af526-bc9e-434d-bf64-4eb4448a9a91" />
</div>
<h4>علاج الالم</h4>
<ul>
<li>
الألم هو احد الاعراض التي يعاني منها العديد من المرضى ، سوف
يتم تقييم الألم والأعراض الأخرى ومداوتها على الفور من خلال 
التعامل بجدية مع التقارير الخاصة بالألم والأعراض ، والحصول 
على المعلومات المتعلقة بالسبب في هذه الاعراض وإعادة التقييم 
بشكل منتظم وتغيير العلاج اذا لم تنخفض حدة الاعراض والتعاون 
مع فريق الرعاية الصحية في تقييم خيارات التحكم في الأعراض 
سواء باستخدام الأدوية او دون استخدامها والاجابات الواضحة 
والفورية على الأسئلة وتوافر الوقت اللازم لاتخاذ القرارات 
</li>
</ul>
</container>
`
      : `
      <container>
      <h4>الاستحمام</h4>
      <ul>
      <li>
      يمكن للممرضة أو الممرض مساعدتك في الاستحمام او أخذ دش
      في صباح كل يوم وذلك   وفقا لمدى قدرتك على المشاركة
      </li>
      <li>
      كما يوجد جرس للاستدعاء بجوار الدش في حالات الطوارئ
      </li>
      </ul>
      <div
      style="
      margin-top:  ${HP('1.5')};
      margin-bottom:  ${HP('1.5')};
      width: 100%;
      height: ${HP('30')}
      "
      >
      <img 
      style="
      width: 100%;
      height: 100%;
      object-fit: fill;
      "
      src="https://firebasestorage.googleapis.com/v0/b/udhsmart.appspot.com/o/bathroom.jpg?alt=media&token=f04af526-bc9e-434d-bf64-4eb4448a9a91" />
      </div>
      <h4>علاج الالم</h4>
      <ul>
      <li>
      الألم هو احد الاعراض التي يعاني منها العديد من المرضى ، سوف
      يتم تقييم الألم والأعراض الأخرى ومداوتها على الفور من خلال 
      التعامل بجدية مع التقارير الخاصة بالألم والأعراض ، والحصول 
      على المعلومات المتعلقة بالسبب في هذه الاعراض وإعادة التقييم 
      بشكل منتظم وتغيير العلاج اذا لم تنخفض حدة الاعراض والتعاون 
      مع فريق الرعاية الصحية في تقييم خيارات التحكم في الأعراض 
      سواء باستخدام الأدوية او دون استخدامها والاجابات الواضحة 
      والفورية على الأسئلة وتوافر الوقت اللازم لاتخاذ القرارات 
      </li>
      </ul>
      </container>
      `,
  },
];
